{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "Flatten", "config": {"name": "flatten_1", "dtype": "float32", "trainable": true, "batch_input_shape": [null, 4, 84, 84]}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "use_bias": true, "trainable": true, "units": 6, "bias_regularizer": null, "bias_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}}}]}