{"backend": "tensorflow", "config": [{"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 4, 84, 84]}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activity_regularizer": null, "units": 6, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "kernel_regularizer": null, "name": "dense_1", "use_bias": true}}], "class_name": "Sequential", "keras_version": "2.0.2"}