{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "Conv2D", "config": {"activation": "linear", "dtype": "float32", "kernel_size": [8, 8], "filters": 32, "trainable": true, "strides": [4, 4], "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "batch_input_shape": [null, 4, 84, 84], "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_size": [4, 4], "filters": 64, "trainable": true, "strides": [2, 2], "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_size": [3, 3], "filters": 64, "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "units": 512, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "units": 6, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2"}}]}