{"backend": "tensorflow", "config": [{"config": {"trainable": true, "activation": "linear", "name": "conv2d_1", "padding": "same", "strides": [4, 4], "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 4, 84, 84], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [8, 8], "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "activation": "linear", "name": "conv2d_2", "padding": "same", "strides": [2, 2], "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "filters": 64, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [4, 4]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "activation": "linear", "name": "conv2d_3", "padding": "same", "strides": [1, 1], "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "filters": 64, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activation": "linear", "name": "dense_1", "units": 512, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "activation": "linear", "name": "dense_2", "units": 6, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2"}