{"keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 4, 84, 84], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "strides": [4, 4], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "name": "conv2d_1", "dtype": "float32", "bias_constraint": null, "kernel_constraint": null, "kernel_size": [8, 8]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "padding": "same", "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "strides": [2, 2], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "name": "conv2d_2", "bias_constraint": null, "kernel_constraint": null, "kernel_size": [4, 4]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "padding": "same", "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "strides": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "name": "conv2d_3", "bias_constraint": null, "kernel_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 6, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "name": "dense_2"}}]}