{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_size": [8, 8], "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "filters": 32, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "conv2d_1", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "dtype": "float32", "strides": [4, 4], "batch_input_shape": [null, 4, 84, 84], "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "conv2d_2", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "strides": [2, 2], "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "conv2d_3", "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "units": 512, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "units": 6, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.0.1", "backend": "tensorflow"}