{"config": [{"config": {"dtype": "float32", "name": "flatten_1", "trainable": true, "batch_input_shape": [null, 4, 84, 84]}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "activation": "linear", "units": 6, "bias_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}