{"keras_version": "2.0.2", "config": [{"config": {"batch_input_shape": [null, 4, 84, 84], "trainable": true, "dtype": "float32", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "units": 6, "bias_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "name": "dense_1", "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}