{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "batch_input_shape": [null, 4, 84, 84], "dtype": "float32"}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "trainable": true, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "use_bias": true, "activity_regularizer": null, "units": 6, "bias_regularizer": null}}], "keras_version": "2.0.2"}