{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "kernel_size": [8, 8], "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "strides": [4, 4], "filters": 32, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "trainable": true, "bias_constraint": null, "batch_input_shape": [null, 4, 84, 84], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "kernel_size": [4, 4], "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "strides": [2, 2], "name": "conv2d_2", "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "kernel_size": [3, 3], "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "strides": [1, 1], "name": "conv2d_3", "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "units": 512, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "name": "dense_2", "units": 6, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}]}