{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 4, 84, 84], "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"filters": 32, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [4, 4], "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "kernel_size": [8, 8], "name": "conv2d_1", "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "padding": "same", "bias_regularizer": null}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "kernel_size": [4, 4], "name": "conv2d_2", "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "padding": "same", "bias_regularizer": null}, "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "kernel_size": [3, 3], "name": "conv2d_3", "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "padding": "same", "bias_regularizer": null}, "name": "conv2d_3", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 512, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 512, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "name": "dense_3", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null}, "name": "dense_3", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 6, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 1, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "name": "dense_4", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null}, "name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Merge", "config": {"mode_type": "lambda", "arguments": {}, "output_shape": [6], "name": "merge_1", "output_mask": null, "output_mask_type": "raw", "output_shape_type": "raw", "concat_axis": -1, "mode": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s!\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000\u0019\u0083\u0001\u0000\u0018|\u0000\u0000d\u0002\u0000\u0019\u0017S)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0007backend\u00da\u0004mean)\u0001\u00da\u0001x\u00a9\u0000r\u0006\u0000\u0000\u0000\u00faH/pylon5/ci560ip/shivangs/deepRL/deeprl_hw2_src_ALL_NETWORKS/dqn_atari.py\u00da\b<lambda>Q\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "dot_axes": -1}, "name": "merge_1", "inbound_nodes": [[["dense_2", 0, 0, {"mask": [null, null]}], ["dense_4", 0, 0, {"mask": [null, null]}]]]}], "name": "model_1", "output_layers": [["merge_1", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.2"}