{"class_name": "Model", "keras_version": "2.0.2", "backend": "tensorflow", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 4, 84, 84], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv2d_1", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [8, 8], "use_bias": true, "data_format": "channels_last", "trainable": true, "strides": [4, 4], "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "bias_constraint": null, "activation": "relu", "filters": 32, "dilation_rate": [1, 1]}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "conv2d_2", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [4, 4], "use_bias": true, "data_format": "channels_last", "trainable": true, "strides": [2, 2], "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "bias_constraint": null, "activation": "relu", "filters": 64, "dilation_rate": [1, 1]}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "conv2d_3", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "bias_constraint": null, "activation": "relu", "filters": 64, "dilation_rate": [1, 1]}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "units": 512}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"name": "dense_3", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "units": 512}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "units": 6}}, {"name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"name": "dense_4", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "units": 1}}, {"name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["dense_2", 0, 0, {"mask": [null, null]}], ["dense_4", 0, 0, {"mask": [null, null]}]]], "config": {"dot_axes": -1, "name": "merge_1", "output_shape_type": "raw", "mode_type": "lambda", "mode": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s!\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000\u0019\u0083\u0001\u0000\u0018|\u0000\u0000d\u0002\u0000\u0019\u0017S)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0007backend\u00da\u0004mean)\u0001\u00da\u0001x\u00a9\u0000r\u0006\u0000\u0000\u0000\u00faH/pylon5/ci560ip/shivangs/deepRL/deeprl_hw2_src_ALL_NETWORKS/dqn_atari.py\u00da\b<lambda>Q\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [6], "output_mask": null, "output_mask_type": "raw", "arguments": {}, "concat_axis": -1}}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["merge_1", 0, 0]]}}