{"keras_version": "2.0.2", "config": [{"config": {"name": "flatten_1", "trainable": true, "batch_input_shape": [null, 4, 84, 84], "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "kernel_regularizer": null, "bias_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "activation": "linear", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 6, "activity_regularizer": null, "name": "dense_1", "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}