{"config": [{"config": {"batch_input_shape": [null, 4, 84, 84], "strides": [4, 4], "padding": "same", "name": "conv2d_1", "kernel_size": [8, 8], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "filters": 32, "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "same", "strides": [2, 2], "kernel_regularizer": null, "name": "conv2d_2", "kernel_size": [4, 4], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "same", "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_3", "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "units": 512, "trainable": true, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "units": 6, "trainable": true, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}