{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"name": "flatten_1", "batch_input_shape": [null, 4, 84, 84], "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"units": 6, "bias_constraint": null, "name": "dense_1", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "activation": "linear", "bias_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null}}], "backend": "tensorflow"}