{"config": [{"config": {"activation": "linear", "use_bias": true, "kernel_size": [8, 8], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "batch_input_shape": [null, 4, 84, 84], "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "filters": 32, "strides": [4, 4]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"activation": "linear", "padding": "same", "kernel_size": [4, 4], "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 64, "name": "conv2d_2", "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"activation": "linear", "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 64, "name": "conv2d_3", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "use_bias": true, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"activation": "linear", "use_bias": true, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 6, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_constraint": null, "name": "dense_2"}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}