{"class_name": "Model", "keras_version": "2.0.2", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 4, 84, 84]}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "filters": 32, "kernel_size": [8, 8], "use_bias": true, "strides": [4, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_1", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "filters": 64, "kernel_size": [4, 4], "use_bias": true, "strides": [2, 2], "kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_2", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "filters": 64, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_3", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "name": "dense_1", "units": 512, "trainable": true}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "name": "dense_3", "units": 512, "trainable": true}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "name": "dense_2", "units": 6, "trainable": true}}, {"name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "name": "dense_4", "units": 1, "trainable": true}}, {"name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["dense_2", 0, 0, {"mask": [null, null]}], ["dense_4", 0, 0, {"mask": [null, null]}]]], "config": {"arguments": {}, "mode_type": "lambda", "output_shape": [6], "concat_axis": -1, "dot_axes": -1, "name": "merge_1", "output_mask_type": "raw", "output_shape_type": "raw", "output_mask": null, "mode": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s!\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000\u0019\u0083\u0001\u0000\u0018|\u0000\u0000d\u0002\u0000\u0019\u0017S)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000)\u0002\u00da\u0007backend\u00da\u0004mean)\u0001\u00da\u0001x\u00a9\u0000r\u0006\u0000\u0000\u0000\u00fa\u0010dqn_atari_cpu.py\u00da\b<lambda>Q\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["merge_1", 0, 0]]}, "backend": "tensorflow"}