{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Flatten", "config": {"name": "flatten_1", "batch_input_shape": [null, 4, 84, 84], "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "units": 6, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null}}], "keras_version": "2.0.2"}