{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "batch_input_shape": [null, 4, 84, 84], "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "kernel_regularizer": null, "bias_constraint": null, "units": 6, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null}}]}