{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "Flatten", "config": {"batch_input_shape": [null, 4, 84, 84], "trainable": true, "dtype": "float32", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 6, "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "name": "dense_1", "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}}]}