{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "kernel_regularizer": null, "batch_input_shape": [null, 4, 84, 84], "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "padding": "same", "strides": [4, 4], "kernel_size": [8, 8], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "dtype": "float32", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "bias_constraint": null, "padding": "same", "strides": [2, 2], "kernel_size": [4, 4], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "bias_constraint": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "units": 512, "activation": "linear", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "units": 6, "activation": "linear", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}