{"keras_version": "2.0.1", "backend": "tensorflow", "config": [{"config": {"use_bias": true, "kernel_size": [8, 8], "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "strides": [4, 4], "batch_input_shape": [null, 4, 84, 84], "name": "conv2d_1", "bias_constraint": null, "trainable": true, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "dtype": "float32", "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "strides": [2, 2], "name": "conv2d_2", "bias_constraint": null, "trainable": true, "filters": 64, "activation": "linear", "kernel_size": [4, 4], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "strides": [1, 1], "name": "conv2d_3", "bias_constraint": null, "trainable": true, "filters": 64, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "units": 512, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "units": 6, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}