{"config": [{"config": {"name": "conv2d_1", "activity_regularizer": null, "kernel_size": [8, 8], "kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "strides": [4, 4], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "bias_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 4, 84, 84], "padding": "same", "filters": 32, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "conv2d_2", "activity_regularizer": null, "kernel_size": [4, 4], "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "kernel_constraint": null, "padding": "same", "filters": 64, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "conv2d_3", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "kernel_constraint": null, "padding": "same", "filters": 64, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "units": 512, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dense_2", "activity_regularizer": null, "kernel_regularizer": null, "units": 6, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.1"}