{"keras_version": "2.0.2", "backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "batch_input_shape": [null, 4, 84, 84], "dtype": "float32", "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "strides": [4, 4], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_size": [8, 8], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "padding": "same", "use_bias": true, "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "filters": 64, "strides": [2, 2], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_size": [4, 4], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "padding": "same", "use_bias": true, "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "padding": "same", "use_bias": true, "name": "conv2d_3"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 512, "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "use_bias": true, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"units": 6, "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "use_bias": true, "name": "dense_2"}, "class_name": "Dense"}], "class_name": "Sequential"}